content-org/o.org
:PROPERTIES:
:EXPORT_DATE: [2018-11-11 Mon 21:49]
:END:

* Monthly notes
:PROPERTIES:
:EXPORT_FILE_NAME: monthly_notes
:EXPORT_HUGO_SECTION: docs/updates
:END:
Extending the [[https://nintil.com/categories/links/][lists]] idea by nintil, I have decided to publish monthly summary of everything I did in that month. This will be useful for me in various ways because I have an extremely fragile memory and this should probably help me re-organize things better in my head also probably easier recall, who knows.

#+attr_html: :class book-hint info
#+begin_quote
It's just be a work of re-organizing and summarizing. Sources for summarizing are as follows:
- =org-journal= or travel entries for the month from [[https://diary.geekodour.org][diary.geekodour.org]]
- links that were finished/dropped from [[file:anti_lib.org::*Posts][anti-library]]
- look at all the commits done to [[https://mogoz.geekodour.org][mogoz]] for the month and summarize learnings
#+end_quote
** 2022
*** July
The whole month of July has been a [[https://www.youtube.com/watch?v=tZYt4tKNTP0][wack]], I don't want to write about it or what I did this month or what I learned this month, I am doing absolutely fine but the month only sucked. I'll write proper summary from next month.
*** August
This was my birthday month. It was pretty interesting. I started off with a lot of enthusiasm that this is the month that I am going to start doing all the shit I always wanted to do. I had the perfect agenda and everything I followed through the first 2-3 days and things quickly became wobbly.

Two major things got flagged off, finally started proper work on [[https://www.instagram.com/ahdultcomic/][@ahdultcomic]] and my [[https://betterkeep.co][first side project]] after a break of more than three years. My best friend left the city so I hardly ever went out and just stayed inside my house the whole month fiddling around different things. Also started working on various other projects. I did some reading and some writing as-well. On the learning side, did a lot of frontend and general systems design stuff and yeah the guitar.

Watched a movie called /Everything Everywhere All at Once/, it was pretty pretty great. Thanks to Anubhav.

Sort of finished one book about end of life planning. It's called /In Case You Get Hit by a Bus/, read this for some reconnaissance on betterkeep, did not finish it as got what I wanted before I finished reading it. Also took some notes.

Read a lot of blogposts throughtout the month, did not keep track, the only ones I have link for:
- [[https://www.spakhm.com/p/tech-stack][Tech stack - by Slava Akhmechet - Zero Credibility]]

Published some writings on my blog:
- [[https://blog.geekodour.org/posts/landing_page_notes/][Landing Page notes]]
- [[https://blog.geekodour.org/posts/bip/][Some ideas about building in public(BIP)]]
- [[https://blog.geekodour.org/posts/market_research/][How to Market Research]]
- [[https://blog.geekodour.org/posts/understanding_offering/][Understanding your offering]]
- [[https://blog.geekodour.org/posts/product_launch_checklist/][Product Launch Checklist]]
- [[https://blog.geekodour.org/posts/cto_checklist/][Lord of all things technical checklist]]

Published two templates, that I think will help me spin up projects faster in the future:
- [[https://blog.geekodour.org/posts/prd-template/][PRD Template]]
- [[https://blog.geekodour.org/posts/arch-template/][Architecture Document Template]]

Overall rating of the month, 6/10. I had some pretty terrible experiences that I cannot mention publicly which weighs down the month by a lot.
*** September
I am writing the monthly note of September on 17th October. Needless to say, the month was pretty fucking hectic for me. No journal entry, nothing.
- We did some progress on getting AhdultComic to speed. The bank really caused so much of issues. We formalized many things about it. Now we have a better idea about what it is and what we want to do.
- Lot of meetings and lot of meetings cancelled and postponed.
- Bought saparscribe.today did not have any fucking idea what to do with it.
- Bangalore got hit by floods
- Cut my own hair by myself for the first time
- Days and nights were full of anxiety for unknown reasons but I kept telling myself otherwise
- Lots of discord calls with friends
- Return of loneliness in life, but said fuck off to it this time
- Started an AI art page where we plan to release the threesixfive calendars later on instagram and twitter. Also planning of creating a discord server.
- Not a lot of progress on betterkeep, but we did make a UX architecture.
- Honestly, lot of time wasted in meeting people for the sake of meeting. Need to reduce meeting people even if I anyway meet less people
- Spent atleast 5 days on the discord server for threesixfive but did not promote it properly yet. Feel like lot of effort went into the wrong area here but we'll see.

Overall rating of the month, 3/10.
*** October
- Started looking out for logistics for threesixfive
- Spending a lot of time on instagram to promote threesixfive, absolutely hating it.
- My friend came in surprised all of us on his birthday
- I finally sorted out my primary and secondary toolchest, big W. It was a lot of manual effort which could not be automated otherwise and long due!
- Little to no progress on betterkeep side, more progress on 365. We fixed a vendor, got paper samples etc.
- The month went pretty fast, because I don't keep daily journal, I don't remember things clearly. But I did go on a road trip to shillong for the weekend.

Overall rating 5/10
*** November
- I moved the syllabus to the homepage and split it better, also understood how i'll like to use anti-lib, syllabus.org, syllabi.org and org-roam, anki, telegram and other tools together. Basically planned on a better, distraction free workflow which works both for work and study.
- I also moved my old wiki to mogoz and moved the history page from old wiki to my homepage. The history page honestly is not funtional at this point but i'll let it be till i create logpad
- Biggest win has to be updates done to [[/docs/documents/day/][a normal day]] and [[/docs/collections/food_drinks/][food and drinks]]. I updated how should my day be like and made it to google calendar exported from org. Secondly, experimented with a lot of tools to finalize by diet and exercise plans. Extemely happy about it. See, these things matter absolutely nothing to anyone else, but for me it's a BIG W. Happy that I am starting to be capable of being happy for my own little efforts.
- There's good progress with threesixfive and some not so good conversations with some partners we're trying to partner up with.
- Going blr soon for sometime yay
*** December
- 1st week went by at EthIndia'22.
- Came back, wrapped everything related to 365 and started selling by 15th December
- Sold few, around 28th my friend left for mumbai, I started writing 365 website on 31st dec.
- No celebrations, rather gloomy

If I had to rate, 2/10
** 2023
*** January
- 365 website finished on 17th Jan, almost two weeks for this. Not happy at all, but was a refresher for many things. Hopefully will be useful.
- Not feeling super cool about things given the current climate of things, preparing myself for the worst mentally, will give it all. Jai mata di.
*** July
- Haha, no notes for last few months. I don't even know what the hell did I do all those months, precisely the point of keeping monthly notes.
- I think I am finally ready to do job hunting now, I am not well prepared or prepared at all. Wait, did I not study 6 months? Well, yes but I studied things I am curious about, not the things that they ask in interviews.
- I plan to apply to a couple of different companies and study for the interviews as I apply. No time.
- I wish I had more time in hand but unfortunately I don't. Gotta run.
** 2024
*** June
- life is like ₜₕᵢₛ, but i like ᵗʰᶦˢ
